ArtShareCompleted/app/controllers/artworks_controller.rb

  def index
      if params[:user_id]
        artworks = Artwork.where(artist_id: params[:user_id])
        artworks += User.find(params[:user_id]).shared_artworks
---
SELECT "artworks".* FROM "artworks" WHERE "artworks"."artist_id" = $1  [["artist_id", 2]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]