ArtShareCompleted/app/controllers/artwork_shares_controller.rb

	def favorite
		artwork_share = ArtworkShare.find_by(id: params[:id], viewer_id: params[:viewer_id])

		artwork_share.favorite = true
		artwork_share.save
---
SELECT  "artwork_shares".* FROM "artwork_shares" WHERE "artwork_shares"."id" = $1 AND "artwork_shares"."viewer_id" = $2 LIMIT $3  [["id", 2], ["viewer_id", 2], ["LIMIT", 1]]
UPDATE "artwork_shares" SET "favorite" = $1, "updated_at" = $2 WHERE "artwork_shares"."id" = $3  [["favorite", true], ["updated_at", "2019-08-27 23:06:16.826133"], ["id", 2]]

	def unfavorite
		artwork_share = ArtworkShare.find_by(id: params[:id], viewer_id: params[:viewer_id])

		artwork_share.favorite = false
		artwork_share.save
---
SELECT  "artwork_shares".* FROM "artwork_shares" WHERE "artwork_shares"."id" = $1 AND "artwork_shares"."viewer_id" = $2 LIMIT $3  [["id", 2], ["viewer_id", 2], ["LIMIT", 1]]
UPDATE "artwork_shares" SET "favorite" = $1, "updated_at" = $2 WHERE "artwork_shares"."id" = $3  [["favorite", false], ["updated_at", "2019-08-27 23:06:24.178456"], ["id", 2]]