ArtShareCompleted/app/controllers/comments_controller.rb

    def index
      if params[:author_id]
        comments = Comment.where(author_id: params[:author_id])
        render json: comments
      elsif params[:artwork_id]
        comments = Comment.where(artwork_id: params[:artwork_id])
---
SELECT "comments".* FROM "comments" WHERE "comments"."author_id" = $1  [["author_id", 5]]
SELECT "comments".* FROM "comments" WHERE "comments"."artwork_id" = $1  [["artwork_id", 2]]

    def create
      comment = Comment.new(comment_params)
      #check if user exists
      user = User.where(id: comment_params[:author_id])
      if !user.empty?
        if comment.save
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
SELECT  1 AS one FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 20], ["LIMIT", 1]]
INSERT INTO "comments" ("author_id", "artwork_id", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["author_id", 1], ["artwork_id", 1], ["body", "this is a test comment"], ["created_at", "2019-08-27 22:10:33.410803"], ["updated_at", "2019-08-27 22:10:33.410803"]]

    def destroy
        comment = Comment.find(params[:id])
        if comment.destroy
---
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 3]]