ArtShareCompleted/app/controllers/likes_controller.rb

    def index
        if params[:user_id]
			likes = User.find(params[:user_id]).likes

            if likes
                liked = likes.map do |like|
                    type = like.likeable_type
                    if type == "Comment"
                        Comment.find(like.likeable_id)
                    elsif type == "Artwork"
                        Artwork.find(like.likeable_id)
                    end
                end
				render json: liked
            else
                render json: likes.errors.full_messages, status: :unprocessable_entity
            end
        elsif params[:artwork_id]
            likes = Artwork.find(params[:artwork_id]).likes
			if likes
                users = likes.map do |like|
                    User.find(like.user_id)
                end
                render json: users
            else
                render json: likes.errors.full_messages, status: :unprocessable_entity
            end
        elsif params[:comment_id]
            likes = Comment.find(params[:comment_id]).likes
            if likes
                users = likes.map do |like|
                    User.find(like.user_id)
---
SELECT "likes".* FROM "likes" WHERE "likes"."user_id" = $1  [["user_id", 3]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT "likes".* FROM "likes" WHERE "likes"."likeable_id" = $1 AND "likes"."likeable_type" = $2  [["likeable_id", 2], ["likeable_type", "Artwork"]]
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]

    def create
        like = Like.new(like_params)

        user = User.where(id: like_params[:user_id])
        if user.empty?
            render plain: "User not found, like couldn't be added", status: :unprocessable_entity
        elsif params[:artwork_id]
            artwork = Artwork.find(params[:artwork_id])
            #check if user exists same in comments_controller#create
                like = artwork.likes.create(user_id: like_params[:user_id])
                if like.valid?
                    render json: like
                else
                    render json: like.errors.full_messages, status: :unprocessable_entity
                end
        elsif params[:comment_id]
            comment = Comment.find(params[:comment_id])
            #check if user exists same in comments_controller#create
			like = comment.likes.create(user_id: like_params[:user_id])
---
SELECT  1 AS one FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
INSERT INTO "likes" ("user_id", "likeable_type", "likeable_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 2], ["likeable_type", "Comment"], ["likeable_id", 4], ["created_at", "2019-08-27 21:34:07.665189"], ["updated_at", "2019-08-27 21:34:07.665189"]]
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "likes" ("user_id", "likeable_type", "likeable_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 3], ["likeable_type", "Comment"], ["likeable_id", 3], ["created_at", "2019-08-27 22:16:32.570333"], ["updated_at", "2019-08-27 22:16:32.570333"]]