ArtShareCompleted/app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT "users".* FROM "users"
---
    def index
        if params[:user_id]
            user = User.find(params[:user_id])
            if user
                render json: user
            else
                render json: user.errors.full_messages, status: :unprocessable_entity
            end
        else
            render json: User.all